/*
Касса магазина. Структура записи операции по кассе: номер кассы, код товара, количество товара, цена товара, процентная скидка на товар, сумма за товар с учетом скидки.
Операции
!Заполнение записи по одной операции с клавиатуры.
Вставить записи по отдельной операции, проведенной кассой, в таблицу, располагая ее в начале списка других операций, проведенных этой кассой.
Вывести список операций, проведенных заданной кассой, с указанием стоимости покупки по каждой операции.
Удалить записи по операциям, проведенным определенной кассой.

*/
#include <iostream>
#include "Header.h"
#include <Windows.h>

using namespace std;

int main()
{
    //TASK 1
    const int N = 100;
    regRow reg[N];
    int n = 0;


    //TASK 2

    //TASK 3
    return 0;
}
